app/controllers/passwords_controller.rb

    def update
        if Current.user.update(password_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-05-25 21:01:57.989160"], ["id", 6]]