app/controllers/password_resets_controller.rb

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2022-05-30 20:47:16.386731"], ["id", 6]]
---
    def update
        @user = User.find_signed(params[:token], purpose: "password_reset")
        if @user.update(password_params)