app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "s@s.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-05-24 10:37:48.542210"], ["updated_at", "2022-05-24 10:37:48.542210"]]
---
    def create
        @user = User.new(user_params)
        if @user.save